(load "rules.scm")

(սահմանել (աըբ թիվ1 թիվ2)
	(եթե (արտ թիվ2 = 0)
		ապա թիվ1
		այլապես (աըբ թիվ2 (արտ թիվ1 մնացորդ թիվ2))))
		
(տպել (աըբ 24 36))

(սահմանել (գծային թիվ1 թիվ2)
	(երբ (արտ (արտ թիվ1 = 0) և (արտ թիվ2 = 0))
	    "Անվերջ"
	    (եթե (արտ թիվ1 = 0)
	    	ապա "Լուծում չունի"
	    	այլապես (- (արտ թիվ2 / թիվ1)))))

(newline)
(տպել (գծային 4 36))

(սահմանել (դիսկրիմինանտ թիվ1 թիվ2 թիվ3) (արտ (արտ թիվ2 * թիվ2) - (արտ 4 * (արտ թիվ1 * թիվ3))))

(սահմանել (միարմատ թիվ1 թիվ2) (արտ (- թիվ2) / (արտ 2 * թիվ1)))

(տպել (դիսկրիմինանտ 3 7 2))
(տպել (միարմատ 3 24))

		 
(սահմանել (քառակուսային թիվ1 թիվ2 թիվ3)
  (եթե (ժխտում (արտ թիվ1 = 0))
      ապա (կատարել
       (վերագրել դ (դիսկրիմինանտ թիվ1 թիվ2 թիվ3))
       (եթե (արտ դ > 0)
           ապա (կատարել
            (վերագրել x1 (արտ (արտ (- թիվ2) + (արմատ դ)) / (արտ 2 * թիվ1)))
            (վերագրել x2 (արտ (արտ (- թիվ2) - (արմատ դ)) / (արտ 2 * թիվ1)))
            (ցուցակ x1 x2))
            այլապես (երբ (արտ դ = 0)
                (միարմատ թիվ1 թիվ2)
                ("Լուծում չունի")))
       )
      այլապես (գծային թիվ2 թիվ3)))
	        
(տպել (քառակուսային 3.0 7.0 2.0))











(տպել (կամ #f #f #f #t #f #f ))
